Repository: SciViews/svMisc
Catalog: po/R-*.po
Languages: fr

source: 'topic' must be a single character string
fr: 'topic' doit être une chaîne de caractères unique

source: '%s' not found, do you mean?
fr: '%s' introuvable, voulez-vous dire ?

source: '%s' not found in package '%s', do you mean?
fr: '%s' introuvable dans le package ‘%s', voulez-vous dire ?

source: '%s' not found
fr: '%s' introuvable

source: '%s' not found in package '%s'
fr: '%s' introuvable dans le package '%s'

source: Searching keyword in all R help pages for '%s'...
fr: Recherche dans toutes les pages d'aide de R du mot clé ‘%s’…

source: '%s' was found multiple times in:
fr: '%s' a été retrouvée à plusieurs reprises dans :

source: Hint: use 'pkg::topic' to be more accurate
fr: Conseil : utilisez 'pkg::topic' pour plus de précision

source: - See also:
fr: - Voir aussi :

source: - Examples (type `ex` to run them):
fr: - Exemples (tapez `ex` pour les exécuter) :

source: - Comment:
fr: - Commentaire :

source: '%s' comes from '%s'.
fr: '%s' vient de ‘%s’.

source: Displaying that file...
fr: Affichage de ce fichier...

source: Matching help page is '%s'
fr: La page d'aide correspondante est '%s'

source: Possible methods for '%s':
fr: Méthodes possibles pour '%s' :

source: Displaying help page...
fr: Affichage de la page d'aide...

source: Searching all R help pages...
fr: Recherche dans toutes les pages d'aide de R...

source: 'obj' should inherit from 'list'
fr: 'obj' doit être un objet 'list'

source: Data you add in actions must be a named character vector
fr: Les données que vous ajoutez dans les actions doivent être des vecteurs de chaînes de caractères nommées

source: Load... Load R objects
fr: Charger... Charger des objets R

source: Source... Source R code
fr: Sourcer... Sourcer du code R : source()

source: Save as... Save to a file
fr: Sauver sous... Sauver dans un fichier

source: Import... Import data in R
fr: Importer... Importer des données dans R : import()

source: Export... Export data to a file
fr: Exporter... Exporter des données vers un fichier : export()

source: Report... Prepare a report for this object
fr: Reporter... Preparer un rapport pour cet objet : report()

source: Set Working dir... Change current R working directory
fr: Changer le répertoire de travail... Changer le répertoire de travail courant : setwd()

source: Print or show Print or show the content of the object
fr: Visualiser... Visualiser le contenu de l'objet : print() ou show()

source: <<<fun>>>() Apply method <<<fun>>>() to the object
fr: <<<fun>>>() Appliquer la méthode <<<fun>>>() à l'objet

source: Names Names of variables contained in the object
fr: Noms Nom des variables contenues dans l'objet : names()

source: Str Compact str() representation of an object
fr: Str Représentation compacte de l'objet : str()

source: Help Help on an object
fr: Aide Aide sur un objet

source: Example Run examples for this object
fr: Exemple Exacuter les exemples pour cet objet : example()

source: Edit Edit an object
fr: Editer Editer un objet : edit()

source: Fix Fix an R object
fr: Réparer Réparer un objet R

source: Load package(s) Load one or several R packages
fr: Charger un ou plusieurs packages Charger un ou plusieurs paquets R

source: Remove Remove (permanently!) one or several objects from memory
fr: Effacer Effacer (de manière permanente !) un ou plusieurs objets de la mémoire

source: Require <<<pkg>>> Require the package <<<pkg>>>
fr: Requière le <<<pkg>>> Requiérir le package <<<pkg>>>

source: Attach Attach an object to the search path
fr: Attacher Attacher un objet au chemin de recherche de R

source: Detach Detach an object or package from the search path
fr: Détacher Détacher un objet ou un package du chemin de recherche

source: Detach and unload Detach a package from the search path and unload it
fr: Détacher et décharger Détacher un package du chemin de recherche et le décharger de la mémoire

source: Reattach Reattach an object to the search path
fr: Réattacher Réattacher un objet au chemin de recherche

source: Package info Show detailed information for this package
fr: Package info Afficher des informations détaillées sur ce package

source: View (default) Default view for this object
fr: Voir (défaut) Vue par défaut de l'objet

source: View <<<type>>> Display a '<<<type>>>' view for this object
fr: Voir <<<type>>> Afficher une vue '<<<type>>>' pour cet objet

source: Copy (default) Copy this object to the clipboard (default format)
fr: Copier (défaut) Copier cet objet vers le presse-papier (format par défaut)

source: Copy <<<type>>> Copy this object to the clipboard in '<<<type>>>' format
fr: Copier @@@type>>> Copier cet objet vers le presse-papier

source: Functions Generic functions and methods
fr: Fonctions Fonctions génériques et méthodes

source: View View the object
fr: Voir Voir cet objet

source: Copy Copy the object to the clipboard
fr: Copier Copier l'objet vers le presse-papier

source: 'obj' should inherit from 'character'
fr: 'obj' doit être un objet 'character'

source: Icons map you add must be a named character vector
fr: Le mappage des icônes que vous ajoutez doit être un vecteur de chaînes de caractères nommées

source: 'fun' must be a function
fr: 'fun’ doit être une fonction

source: Running the batch process with %s...
fr: Exécution du processus par lots avec %s…

source: No items to process!
fr: Aucun élément à traiter !

source: Processed successfully %i items on %i (see .last.batch)
fr: Traitement réussi de %i éléments sur les %i (voir .last.batch)

source: 'expr' is NULL or of length zero. It must be an expression or NA
fr: ‘expr’ est NULL or de longueur nulle. Il doit être une expression ou NA

source: 'expr' must be an expression or NA
fr: ‘expr’ doit être une expression ou NA

source: In addition:
fr: En outre :

source: <aborted!>
fr: <arrêté prématurément!>

source: <interrupted!>
fr: <interrompu!>

source: Generic function with methods for the following classes:
fr: Fonction générique avec des méthodes pour les classes suivantes :

source: You must provide at least one file path
fr: Vous devez fournir au moins un chemin d'accès au fichier

source: Template file '%s' not found, starting from an empty file
fr: Le fichier modèle '%s' n’a pas été trouvé, initialisation depuis un fichier vide

source: Cannot edit files: no editor or not in interactive mode
fr: Impossible de modifier les fichiers : pas d'éditeur ou pas en mode interactif

source: Editing the file '%s'... Close the editor to continue!
fr: Édition du fichier '%s'… Fermez l'éditeur pour continuer !

source: only one item for 'file' is accepted
fr: un seul élément pour "fichier" est accepté

source: .file_edit_rstudio() cannot be used outside RStudio.
fr: .file_edit_rstudio() ne peut pas être utilisé en dehors de RStudio.

source: impossible to get .rs.api.navigateToFile() function
fr: impossible d'obtenir la fonction .rs.api.navigateToFile()

source: impossible to get editor context... cannot honor wait = TRUE
fr: impossible d'obtenir le contexte de l'éditeur... impossible d'honorer wait = TRUE

source: Editing file '%s'... Close the editor, or switch to another one to continue!
fr: Édition du fichier ‘%s’… Fermez l'éditeur ou passez à un autre pour continuer !

source: only one item for 'title' is accepted
fr: un seul élément pour le ‘titre’ est accepté

source: .file_edit_rgui() cannot be used outside Rgui.
fr: .file_edit_rgui() ne peut pas être utilisé en dehors de Rgui.

source: Editing file '%s'... Close the editor to continue!
fr: Édition du fichier ‘%s’… Fermez l'éditeur pour continuer !

source: Natural language support is available on this system,
fr: Ce système offre une assistance en langage naturel,

source: but unable to properly switch language.
fr: mais impossible de changer correctement de langue.

source: Unable to switch to language '%s'. Using current language '%s' instead (displayed only once per session).
fr: Impossible de passer à la langue '%s'. Utilisation de la langue actuelle '%s' à la place (affiché une seule fois par session).

source: Test of svMisc's `gettext()` and `gettextf()`:
fr: Test des fonctions `gettext()` et `gettextf()` de svMisc :

source: This should be transtlated, if '%s' language is supported.
fr: Ceci doit être traduit si la langue '%s' est prise en charge.

source: This is message number %i
fr: Il s'agit du message numéro %i

source: Nothing to install.
fr: Rien à installer.

source: Install R package
fr: Installation d’un package R

source: The package '%s' will be installed. Proceed?
fr: Le package '%s' sera installé. Poursuivre ?

source: Install R packages
fr: Installation de packages R

source: The following packages will be installed: '%s' Proceed?
fr: Les packages suivants seront installés : '%s' Poursuivre ?

source: Clear the list of packages to install?
fr: Effacer la liste des packages à installer ?

source: 'f' must be a character string!
fr: 'f' doit être une chaîne de caractères !

source: Impossible to create the Object Browser 'path' directory!
fr: Impossible de créer le répertoire pour l’explorateur d'objets !

source: x must be an 'objList' object
fr: x doit être un objet ‘objList’

source: 'strip' must be a 'svStripbar' object
fr: 'strip' doit être un objet 'svStripbar'

source: 'widgets' must be 'menu', 'item', 'sep' or 'space'
fr: 'widgets' doit être 'menu', 'item', 'sep' ou 'space'

source: more than one 'pos' provided; Using only the first one
fr: plus d'un "pos" fourni ; utilisation du premier

source: Unable to load package '%s'! Use `Install()` to make it available...
fr: I’mpossible de charger le package '%s' ! Utilisez `Install()` pour le rendre disponible...

source: Unable to load packages: '%s'! Use `Install()` to make them available...
fr: Impossible de charger les packages : '%s' ! Utilisez `Install()` pour les rendre disponibles...

source: end of input
fr: fin d’entrée

source: This will install package %s.
fr: Ceci installera le package %s.

source: This will install packages: %s and %s.
fr: Cela installera les packages %s and %s.

source: 'value' must be numeric
fr: 'value' doit être numérique

source: 'max.value' must be numeric or NULL
fr: 'max.value' doit être numérique ou NULL

source: Progress:
fr: Progression :

source: on
fr: sur

source: runs must be a single integer between 1 and 10
fr: runs doit être un seul nombre entier entre 1 et 10

source: 'type' could be only 'R', or 'google', currently!
fr: 'type' ne peut être que ‘R’ ou ‘google’, pour l'instant !

source: A search query has been submitted
fr: Une demande de recherche a été soumise

source: The results page should open in your browser shortly
fr: La page des résultats devrait s'ouvrir dans votre navigateur sous peu

source: %s must be a list
fr: %s doit être une liste

source: 'x' must be character
fr: 'x' doit une chaîne de caractères, ou un vecteur de chaînes de caractères

source: Error:
fr: Erreur:

source: Error in
fr: Erreur dans

source: There was %d warning (use warnings_() to see it)
fr: Il y a eu %d avertissement (utilisez warnings_() pour le voir)

source: You asked for only one item
fr: Vous n'avez demandé qu'un seul article
